[Killed] ConditionalExpression
main/components/Commons/CommonsList.js:29:14
             >
                 {props.title}
             </Card.Title>
-            {props.commonList.length > 0 ? 
+            {false ? 
             <React.Fragment>
                 <Card.Subtitle>
killedBy: HomePage tests Redirects to the PlayPage when you click visit
statusReason: Error: Unable to find an element by: [data-testid="commonsCard-button-Visit-1"]

<body>
  <div>
    <div
      data-testid="HomePage-main-div"
      style="background-size: cover; background-image: url(HomePageBackground-day.jpg);"
    >
