[Killed] StringLiteral
src/main/pages/HomePage.js:77:107
         <Container>
           <Row>
 
-            <Col sm><CommonsList commonList={commonsNotJoinedList} title="Join A New Commons" buttonText={"Join"} buttonLink={mutation.mutate} />
+            <Col sm><CommonsList commonList={commonsNotJoinedList} title="Join A New Commons" buttonText={""} buttonLink={mutation.mutate} />
             
             </Col>
killedBy: HomePage tests Calls the callback when you click join
statusReason: Error: Unable to find an element by: [data-testid="commonsCard-button-Join-4"]

<body>
  <div>
    <div
      data-testid="HomePage-main-div"
      style="background-size: cover; background-image: url(HomePageBackground-day.jpg);"
    >
