[Killed] BlockStatement
src/main/utils/users.js:5:28
 import axios from "axios";
 import { useBackendMutation } from "./useBackend";
 
-export function useUsers() {
-  return useQuery(
-    "users",
-    async () => {
-      const uri = "/api/admin/users";
-      try {
-        const response = await axios.get(uri);
-        return response.data;
-      } catch (e) {
-        console.error(`Error getting data from ${uri}:`, e);
-        return [];
-      }
-    },
-    {
-      initialData: [],
-    }
-  );
-}
+export function useUsers() {}
 
 export function useSuspendUser() {
killedBy: AdminUsersPage tests renders without crashing on two users
statusReason: TypeError: Cannot destructure property 'data' of '(0 , _users.useUsers)(...)' as it is undefined.

[Killed] BlockStatement
src/main/utils/users.js:8:17
 export function useUsers() {
   return useQuery(
     "users",
-    async () => {
-      const uri = "/api/admin/users";
-      try {
-        const response = await axios.get(uri);
-        return response.data;
-      } catch (e) {
-        console.error(`Error getting data from ${uri}:`, e);
-        return [];
-      }
-    },
+    async () => {},
     {
       initialData: [],
killedBy: AdminUsersPage tests renders without crashing on two users
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Killed] ObjectLiteral
src/main/utils/users.js:18:5
         return [];
       }
     },
-    {
-      initialData: [],
-    }
+    {}
   );
 }
killedBy: AdminUsersPage tests renders without crashing on two users
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Killed] BlockStatement
src/main/utils/users.js:24:34
   );
 }
 
-export function useSuspendUser() {
-  return useBackendMutation(
-    (cell) => ({
-      method: "post",
-      url: "/api/admin/users/suspend",
-      params: { userId: cell.row.values.id },
-    }),
-    {},
-    // Stryker disable next-line all : hard to set up test for query key invalidation for mutations
-    "users"
-  );
-}
+export function useSuspendUser() {}
 
 export function useRestoreUser() {
killedBy: utils/users tests suspendUser tests suspendUser posts to correct endpoint on successful request
statusReason: TypeError: Cannot read properties of undefined (reading 'mutate')

[Killed] BlockStatement
src/main/utils/users.js:37:34
   );
 }
 
-export function useRestoreUser() {
-  return useBackendMutation(
-    (cell) => ({
-      method: "post",
-      url: "/api/admin/users/restore",
-      params: { userId: cell.row.values.id },
-    }),
-    {},
-    // Stryker disable next-line all : hard to set up test for query key invalidation for mutations
-    "users"
-  );
-}
+export function useRestoreUser() {}
 
killedBy: utils/users tests restoreUser tests restoreUser posts to correct endpoint on success request
statusReason: TypeError: Cannot read properties of undefined (reading 'mutate')
