[Killed] ObjectLiteral
main/components/Users/UsersTable.js:51:5
       Header: "Email",
       accessor: "email",
     },
-    {
-      Header: "Last Online",
-      id: "lastOnline",
-      accessor: (row) => formatTime(row.lastOnline),
-    },
+    {},
     {
       Header: "Admin",
killedBy: UserTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Users/UsersTable.js:66:29
       id: "suspended",
       accessor: (row, _rowIndex) => String(row.suspended), // hack needed for boolean values to show up
     },
-    ButtonColumn("Suspend", "danger", suspendCallback, "UsersTable"),
+    ButtonColumn("Suspend", "", suspendCallback, "UsersTable"),
     ButtonColumn("Restore", "primary", restoreCallback, "UsersTable"),
   ];
killedBy: UserTable tests Has the expected colum headers and content
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn

[Killed] StringLiteral
main/components/Users/UsersTable.js:67:57
       accessor: (row, _rowIndex) => String(row.suspended), // hack needed for boolean values to show up
     },
     ButtonColumn("Suspend", "danger", suspendCallback, "UsersTable"),
-    ButtonColumn("Restore", "primary", restoreCallback, "UsersTable"),
+    ButtonColumn("Restore", "primary", restoreCallback, ""),
   ];
 
killedBy: UserTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-Restore-button"]

<body>
  <div>
    <div
      role="table"
    >
      <table
