[Killed] ConditionalExpression
main/components/Commons/CommonsOverview.js:12:30
     let navigate = useNavigate();
     // Stryker disable next-line all
     const leaderboardButtonClick = () => { navigate("/leaderboard/" + commonsPlus.commons.id) };
-    const showLeaderboard = (hasRole(currentUser, "ROLE_ADMIN") || commonsPlus.commons.showLeaderboard );
+    const showLeaderboard = (false );
     return (
         <Card data-testid="CommonsOverview">
killedBy: CommonsOverview tests Redirects to the LeaderboardPage for an admin when you click visit
statusReason: Error: Unable to find an element by: [data-testid="user-leaderboard-button"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.jpg);"
    >

[Killed] ConditionalExpression
main/components/Commons/CommonsOverview.js:12:30
     let navigate = useNavigate();
     // Stryker disable next-line all
     const leaderboardButtonClick = () => { navigate("/leaderboard/" + commonsPlus.commons.id) };
-    const showLeaderboard = (hasRole(currentUser, "ROLE_ADMIN") || commonsPlus.commons.showLeaderboard );
+    const showLeaderboard = (true );
     return (
         <Card data-testid="CommonsOverview">
killedBy: CommonsOverview tests No LeaderboardPage for an ordinary user when commons has showLeaderboard = false
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] LogicalOperator
main/components/Commons/CommonsOverview.js:23:26
                         <Card.Text>Total Players: {commonsPlus.totalUsers}</Card.Text>
                     </Col>
                     <Col>
-                        {showLeaderboard &&
-                        (<Button variant="outline-success" data-testid="user-leaderboard-button" onClick={leaderboardButtonClick}>
-                            Leaderboard
-                        </Button>)}
+                        {showLeaderboard || <Button variant="outline-success" data-testid="user-leaderboard-button" onClick={leaderboardButtonClick}>
+                            Leaderboard
+                        </Button>}
                     </Col>
                 </Row>
killedBy: CommonsOverview tests Redirects to the LeaderboardPage for an admin when you click visit
statusReason: Error: Unable to find an element by: [data-testid="user-leaderboard-button"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.jpg);"
    >

[Killed] ConditionalExpression
main/components/Commons/CommonsOverview.js:23:26
                         <Card.Text>Total Players: {commonsPlus.totalUsers}</Card.Text>
                     </Col>
                     <Col>
-                        {showLeaderboard &&
-                        (<Button variant="outline-success" data-testid="user-leaderboard-button" onClick={leaderboardButtonClick}>
-                            Leaderboard
-                        </Button>)}
+                        {true}
                     </Col>
                 </Row>
killedBy: CommonsOverview tests Redirects to the LeaderboardPage for an admin when you click visit
statusReason: Error: Unable to find an element by: [data-testid="user-leaderboard-button"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.jpg);"
    >
