[Killed] EqualityOperator
src/main/pages/PlayPage.js:61:33
     );
     // Stryker restore all
 
-    const commonsPlusExists = !(typeof commonsPlus == 'undefined'); 
+    const commonsPlusExists = !(typeof commonsPlus != 'undefined'); 
     let commonsforuser;
     let matched; 
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of null (reading 'user')

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:61:33
     );
     // Stryker restore all
 
-    const commonsPlusExists = !(typeof commonsPlus == 'undefined'); 
+    const commonsPlusExists = !(true); 
     let commonsforuser;
     let matched; 
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element by: [data-testid="CommonsPlay"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:65:9
     let commonsforuser;
     let matched; 
 
-    if (commonsPlusExists) { // only IF the commons exists, get this info 
+    if (false) { // only IF the commons exists, get this info 
         commonsforuser = currentUser.root.user.commons;
         matched = commonsforuser.some(com => com.id === commonsPlus.commons.id);
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element by: [data-testid="CommonsPlay"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:65:9
     let commonsforuser;
     let matched; 
 
-    if (commonsPlusExists) { // only IF the commons exists, get this info 
+    if (true) { // only IF the commons exists, get this info 
         commonsforuser = currentUser.root.user.commons;
         matched = commonsforuser.some(com => com.id === commonsPlus.commons.id);
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of null (reading 'user')

[Killed] EqualityOperator
src/main/pages/PlayPage.js:67:46
 
     if (commonsPlusExists) { // only IF the commons exists, get this info 
         commonsforuser = currentUser.root.user.commons;
-        matched = commonsforuser.some(com => com.id === commonsPlus.commons.id);
+        matched = commonsforuser.some(com => com.id !== commonsPlus.commons.id);
     }
 
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element by: [data-testid="CommonsPlay"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:67:46
 
     if (commonsPlusExists) { // only IF the commons exists, get this info 
         commonsforuser = currentUser.root.user.commons;
-        matched = commonsforuser.some(com => com.id === commonsPlus.commons.id);
+        matched = commonsforuser.some(com => false);
     }
 
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element by: [data-testid="CommonsPlay"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:70:21
         matched = commonsforuser.some(com => com.id === commonsPlus.commons.id);
     }
 
-    const allowed = commonsPlusExists && matched;
+    const allowed = false;
     const notallowed = commonsPlusExists && !matched;
 
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element by: [data-testid="CommonsPlay"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:70:21
         matched = commonsforuser.some(com => com.id === commonsPlus.commons.id);
     }
 
-    const allowed = commonsPlusExists && matched;
+    const allowed = true;
     const notallowed = commonsPlusExists && !matched;
 
killedBy: PlayPage tests User that has not joined any commons is trying to access an unjoined common
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="card" data-testid="commons-card" style="opacity: 0.9;"><h1 class="animate-charcter"> Howdy farmer Phil!</h1></div> instead

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:71:24
     }
 
     const allowed = commonsPlusExists && matched;
-    const notallowed = commonsPlusExists && !matched;
+    const notallowed = false;
 
     // Stryker disable all
killedBy: PlayPage tests User that has not joined any commons is trying to access an unjoined common
statusReason: Error: Unable to find an element with the text: You have yet to join this commons!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:71:24
     }
 
     const allowed = commonsPlusExists && matched;
-    const notallowed = commonsPlusExists && !matched;
+    const notallowed = true;
 
     // Stryker disable all
killedBy: PlayPage tests User that has joined one commons is trying to access a joined common
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h1>You have yet to join this commons!</h1> instead

[Killed] ObjectLiteral
src/main/pages/PlayPage.js:144:29
         setIsChatOpen((prevState) => !prevState);
     };
 
-    const chatButtonStyle = {
-        width: "60px",
-        height: "60px",
-        borderRadius: "25%",
-        backgroundColor: "lightblue",
-        color: "black",
-        position: "fixed",
-        bottom: "30px",
-        right: "30px",
-    };
+    const chatButtonStyle = {};
 
     const chatContainerStyle = {
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- background-color: lightblue;
- border-radius: 25%;
- bottom: 30px;
- color: black;

[Killed] StringLiteral
src/main/pages/PlayPage.js:147:23
     const chatButtonStyle = {
         width: "60px",
         height: "60px",
-        borderRadius: "25%",
+        borderRadius: "",
         backgroundColor: "lightblue",
         color: "black",
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

  background-color: lightblue;
- border-radius: 25%;
  bottom: 30px;
  color: black;

[Killed] StringLiteral
src/main/pages/PlayPage.js:151:17
         backgroundColor: "lightblue",
         color: "black",
         position: "fixed",
-        bottom: "30px",
+        bottom: "",
         right: "30px",
     };
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

  background-color: lightblue;
  border-radius: 25%;
- bottom: 30px;
  color: black;

[Killed] StringLiteral
src/main/pages/PlayPage.js:159:16
         width: "550px",
         position: "fixed",
         bottom: "100px",
-        right: "20px",
+        right: "",
     };
 
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

  bottom: 100px;
  position: fixed;
- right: 20px;
  width: 550px;

[Killed] StringLiteral
src/main/pages/PlayPage.js:164:19
 
     const emojiStyle = {
         fontFamily: "Arial, sans-serif",
-        fontSize: "30px",
+        fontSize: "",
     };
 
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- font-size: 30px;

[Killed] StringLiteral
src/main/pages/PlayPage.js:170:33
     return (
         <div
             style={{
-                backgroundSize: "cover",
+                backgroundSize: "",
                 backgroundImage: `url(${Background})`,
             }}
killedBy: PlayPage tests Make sure div has correct attributes
statusReason: Error: expect(element).toHaveAttribute("style", StringContaining "background-size: cover; background-image: url(PlayPageBackground.jpg);") // element.getAttribute("style") === StringContaining "background-size: cover; background-image: url(PlayPageBackground.jpg);"

Expected the element to have attribute:
  style=StringContaining "background-size: cover; background-image: url(PlayPageBackground.jp

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:177:22
         >
             <BasicLayout>
                 <Container>
-                    {allowed && !!currentUser && <CommonsPlay currentUser={currentUser} />}
+                    {false}
                     {notallowed && <h1>You have yet to join this commons!</h1>}
                     {!!commonsPlus && (
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element by: [data-testid="CommonsPlay"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:177:34
         >
             <BasicLayout>
                 <Container>
-                    {allowed && !!currentUser && <CommonsPlay currentUser={currentUser} />}
+                    {allowed && !currentUser && <CommonsPlay currentUser={currentUser} />}
                     {notallowed && <h1>You have yet to join this commons!</h1>}
                     {!!commonsPlus && (
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element by: [data-testid="CommonsPlay"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:178:22
             <BasicLayout>
                 <Container>
                     {allowed && !!currentUser && <CommonsPlay currentUser={currentUser} />}
-                    {notallowed && <h1>You have yet to join this commons!</h1>}
+                    {true}
                     {!!commonsPlus && (
                         <CommonsOverview
killedBy: PlayPage tests User that has not joined any commons is trying to access an unjoined common
statusReason: Error: Unable to find an element with the text: You have yet to join this commons!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:178:22
             <BasicLayout>
                 <Container>
                     {allowed && !!currentUser && <CommonsPlay currentUser={currentUser} />}
-                    {notallowed && <h1>You have yet to join this commons!</h1>}
+                    {false}
                     {!!commonsPlus && (
                         <CommonsOverview
killedBy: PlayPage tests User that has not joined any commons is trying to access an unjoined common
statusReason: Error: Unable to find an element with the text: You have yet to join this commons!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] LogicalOperator
src/main/pages/PlayPage.js:179:22
                 <Container>
                     {allowed && !!currentUser && <CommonsPlay currentUser={currentUser} />}
                     {notallowed && <h1>You have yet to join this commons!</h1>}
-                    {!!commonsPlus && (
-                        <CommonsOverview
-                            commonsPlus={commonsPlus}
-                            currentUser={currentUser}
-                        />
-                    )}
+                    {!!commonsPlus || <CommonsOverview commonsPlus={commonsPlus} currentUser={currentUser} />}
                     <br />
                     {!!userCommons && !!commonsPlus && (
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'commons')

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:179:23
                 <Container>
                     {allowed && !!currentUser && <CommonsPlay currentUser={currentUser} />}
                     {notallowed && <h1>You have yet to join this commons!</h1>}
-                    {!!commonsPlus && (
+                    {!commonsPlus && (
                         <CommonsOverview
                             commonsPlus={commonsPlus}
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'commons')

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:186:39
                         />
                     )}
                     <br />
-                    {!!userCommons && !!commonsPlus && (
+                    {!!userCommons && !commonsPlus && (
                         <CardGroup>
                             <ManageCows
killedBy: PlayPage tests click buy button
statusReason: Error: Unable to find an element by: [data-testid="buy-cow-button"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.jpg);"
    >

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:213:15
                     )}
                 </Container>
             </BasicLayout>
-            { (hasRole(currentUser, "ROLE_ADMIN") || (!!commonsPlus && commonsPlus.commons.showChat)) &&
-                <div style={chatContainerStyle} data-testid="playpage-chat-div">
-                    {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
-                    <Button
-                        style={chatButtonStyle}
-                        onClick={toggleChatWindow}
-                        data-testid="playpage-chat-toggle"
-                    >
-                        {!!isChatOpen ? (
-                            <span style={emojiStyle} data-testid="close-icon">
-                                ❌
-                            </span>
-                        ) : (
-                            <span style={emojiStyle} data-testid="message-icon">
-                                💬
-                            </span>
-                        )}
-                    </Button>
-                </div>
+            { false
             }
         </div>
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Error: Unable to find an element by: [data-testid="playpage-chat-toggle"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:215:23
             </BasicLayout>
             { (hasRole(currentUser, "ROLE_ADMIN") || (!!commonsPlus && commonsPlus.commons.showChat)) &&
                 <div style={chatContainerStyle} data-testid="playpage-chat-div">
-                    {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
+                    {!isChatOpen && <ChatPanel commonsId={commonsId} />}
                     <Button
                         style={chatButtonStyle}
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Error: expect(element).not.toBeInTheDocument()

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:215:22
             </BasicLayout>
             { (hasRole(currentUser, "ROLE_ADMIN") || (!!commonsPlus && commonsPlus.commons.showChat)) &&
                 <div style={chatContainerStyle} data-testid="playpage-chat-div">
-                    {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
+                    {true}
                     <Button
                         style={chatButtonStyle}
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Error: Unable to find an element by: [data-testid="ChatPanel"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div
