[Killed] EqualityOperator
src/main/pages/PlayPage.js:61:33
     );
     // Stryker restore all
 
-    const commonsPlusExists = !(typeof commonsPlus == 'undefined'); // does the commons exist?
+    const commonsPlusExists = !(typeof commonsPlus != 'undefined'); // does the commons exist?
     let commonsforuser;
     let matched; 
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of null (reading 'user')

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:61:33
     );
     // Stryker restore all
 
-    const commonsPlusExists = !(typeof commonsPlus == 'undefined'); // does the commons exist?
+    const commonsPlusExists = !(true); // does the commons exist?
     let commonsforuser;
     let matched; 
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element by: [data-testid="CommonsPlay"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div
