[Killed] ConditionalExpression
src/main/pages/PlayPage.js:65:9
     let commonsforuser;
     let matched; 
 
-    if (commonsPlusExists) { 
+    if (false) { 
         commonsforuser = currentUser.root.user.commons;
         matched = commonsforuser.some(com => com.id === commonsPlus.commons.id);
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element by: [data-testid="CommonsPlay"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:65:9
     let commonsforuser;
     let matched; 
 
-    if (commonsPlusExists) { 
+    if (true) { 
         commonsforuser = currentUser.root.user.commons;
         matched = commonsforuser.some(com => com.id === commonsPlus.commons.id);
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of null (reading 'user')

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:177:22
         >
             <BasicLayout>
                 <Container> 
-                    {!commonsPlus && <h1>This commons does not exist!</h1>}
+                    {false}
                     {notallowed && <h1>You have yet to join this commons!</h1>} 
                     {allowed && !!currentUser && <CommonsPlay currentUser={currentUser} />}
killedBy: PlayPage tests User not allowed to access a commons that does not exist
statusReason: Error: Unable to find an element with the text: This commons does not exist!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:177:22
         >
             <BasicLayout>
                 <Container> 
-                    {!commonsPlus && <h1>This commons does not exist!</h1>}
+                    {true}
                     {notallowed && <h1>You have yet to join this commons!</h1>} 
                     {allowed && !!currentUser && <CommonsPlay currentUser={currentUser} />}
killedBy: PlayPage tests User not allowed to access a commons that does not exist
statusReason: Error: Unable to find an element with the text: This commons does not exist!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:178:22
             <BasicLayout>
                 <Container> 
                     {!commonsPlus && <h1>This commons does not exist!</h1>}
-                    {notallowed && <h1>You have yet to join this commons!</h1>} 
+                    {true} 
                     {allowed && !!currentUser && <CommonsPlay currentUser={currentUser} />}
                     
killedBy: PlayPage tests User that has not joined any commons is trying to access an unjoined common
statusReason: Error: Unable to find an element with the text: You have yet to join this commons!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:178:22
             <BasicLayout>
                 <Container> 
                     {!commonsPlus && <h1>This commons does not exist!</h1>}
-                    {notallowed && <h1>You have yet to join this commons!</h1>} 
+                    {false} 
                     {allowed && !!currentUser && <CommonsPlay currentUser={currentUser} />}
                     
killedBy: PlayPage tests User that has not joined any commons is trying to access an unjoined common
statusReason: Error: Unable to find an element with the text: You have yet to join this commons!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] LogicalOperator
src/main/pages/PlayPage.js:179:22
                 <Container> 
                     {!commonsPlus && <h1>This commons does not exist!</h1>}
                     {notallowed && <h1>You have yet to join this commons!</h1>} 
-                    {allowed && !!currentUser && <CommonsPlay currentUser={currentUser} />}
+                    {allowed && !!currentUser || <CommonsPlay currentUser={currentUser} />}
                     
                     {!!commonsPlus && (
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element by: [data-testid="CommonsPlay"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:179:22
                 <Container> 
                     {!commonsPlus && <h1>This commons does not exist!</h1>}
                     {notallowed && <h1>You have yet to join this commons!</h1>} 
-                    {allowed && !!currentUser && <CommonsPlay currentUser={currentUser} />}
+                    {false}
                     
                     {!!commonsPlus && (
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element by: [data-testid="CommonsPlay"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:181:22
                     {notallowed && <h1>You have yet to join this commons!</h1>} 
                     {allowed && !!currentUser && <CommonsPlay currentUser={currentUser} />}
                     
-                    {!!commonsPlus && (
-                        <CommonsOverview
-                            commonsPlus={commonsPlus}
-                            currentUser={currentUser}
-                        />
-                    )}
+                    {true}
                     <br />
                     {!!userCommons && !!commonsPlus && (
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element with the text: /Announcements/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:181:22
                     {notallowed && <h1>You have yet to join this commons!</h1>} 
                     {allowed && !!currentUser && <CommonsPlay currentUser={currentUser} />}
                     
-                    {!!commonsPlus && (
-                        <CommonsOverview
-                            commonsPlus={commonsPlus}
-                            currentUser={currentUser}
-                        />
-                    )}
+                    {false}
                     <br />
                     {!!userCommons && !!commonsPlus && (
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element with the text: /Announcements/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:215:55
                     )}
                 </Container>
             </BasicLayout>
-            { (hasRole(currentUser, "ROLE_ADMIN") || (!!commonsPlus && commonsPlus.commons.showChat)) &&
+            { (hasRole(currentUser, "ROLE_ADMIN") || (false)) &&
                 <div style={chatContainerStyle} data-testid="playpage-chat-div">
                     {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Error: Unable to find an element by: [data-testid="playpage-chat-toggle"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:215:15
                     )}
                 </Container>
             </BasicLayout>
-            { (hasRole(currentUser, "ROLE_ADMIN") || (!!commonsPlus && commonsPlus.commons.showChat)) &&
-                <div style={chatContainerStyle} data-testid="playpage-chat-div">
-                    {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
-                    <Button
-                        style={chatButtonStyle}
-                        onClick={toggleChatWindow}
-                        data-testid="playpage-chat-toggle"
-                    >
-                        {!!isChatOpen ? (
-                            <span style={emojiStyle} data-testid="close-icon">
-                                ❌
-                            </span>
-                        ) : (
-                            <span style={emojiStyle} data-testid="message-icon">
-                                💬
-                            </span>
-                        )}
-                    </Button>
-                </div>
+            { true
             }
         </div>
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Error: Unable to find an element by: [data-testid="playpage-chat-toggle"]

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div
