[Killed] ArithmeticOperator
main/components/Commons/CommonsForm.js:74:23
     const testid = "CommonsForm";
     const curr = new Date();
     const today = curr.toLocaleDateString('en-CA'); // Canadian english gives YYYY-MM-DD
-    const currMonth = curr.getMonth() % 12;
+    const currMonth = curr.getMonth() * 12;
     const nextMonth = new Date(curr.getFullYear(), currMonth + 1, curr.getDate()).toISOString().substr(0, 10);
     const DefaultVals = {
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2024-07-03)

Expected the element to have value:
  2024-07-03
Received:
  2029-02-03
